src/cf/DocumentJournals/ДокументыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоставщиков</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.ОтчетКомитентуОПродажах</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПлатежноеПоручение</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.СписаниеСРасчетногоСчета</xr:Item>
				<xr:Item>Document.ГТДИмпорт</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.СчетФактураПолученный</xr:Item>
				<xr:Item>Document.КорректировкаПоступления</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.ЗаявлениеОВвозеТоваров</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.ДоговорКонтрагента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Организация</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Организация</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.Организация</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.Организация</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.Организация</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СуммаДокумента</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.ТаможенныйСбор</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.ВалютаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ПлатежноеПоручение.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ГТДИмпорт.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<References>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.ПодразделениеОрганизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>Дата входящего документа</Comment>
					<References>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.ДатаВходящегоДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>Номер входящего документа</Comment>
					<References>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеДопРасходов.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.СчетНаОплатуПоставщика.Attribute.НомерВходящегоДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидОперации</Name>
					<References>
						<xr:Item>Document.ВозвратТоваровПоставщику.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.КорректировкаПоступления.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ОтчетКомитентуОПродажах.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПоступлениеТоваровУслуг.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.СчетФактураПолученный.Attribute.ВидСчетаФактуры</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/DocumentJournals/ДокументыПоставщиков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов поставщиков'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Соответствие;
	
	ПолеЗапросаНомер =
	"	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СчетФактураПолученный)
	|			ТОГДА ВЫРАЗИТЬ(Таб.Ссылка КАК Документ.СчетФактураПолученный).ПредставлениеНомера
	|		ИНАЧЕ Таб.Номер
	|	КОНЕЦ";
	
	ПолеЗапросаДатаВх =
	"	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПоступлениеТоваровУслуг)
	|				ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СписаниеСРасчетногоСчета)
	|				ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СчетНаОплатуПоставщика)
	|				ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СчетФактураПолученный)
	|			ТОГДА Таб.ДатаВходящегоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	
	Результат.Вставить("Номер,",                 ПолеЗапросаНомер);
	Результат.Вставить("ДатаВходящегоДокумента", ПолеЗапросаДатаВх);
	Результат.Вставить("НомерВходящегоДокумента",
		СтрЗаменить(ПолеЗапросаДатаВх, "ДатаВходящегоДокумента", "НомерВходящегоДокумента"));
	Результат.Вставить("Информация",   "Контрагент");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
